# Задача-1:
# Дан список фруктов.
# Напишите программу, выводящую фрукты в виде нумерованного списка,
# выровненного по правой стороне.

# Пример:
# Дано: ["яблоко", "банан", "киви", "арбуз"]
# Вывод:
# 1. яблоко
# 2.  банан
# 3.   киви
# 4.  арбуз

# Подсказка: воспользоваться методом .format()



fruits = ["яблоко", "банан", "киви", "арбуз"]
i = 1
for fruit in fruits:
    print(f'{i}. {fruit:>8}')
    i += 1
